aws/amazon-freertos/vendors/cypress/psoc6/mw/capsense/cy_capsense_csd.c
/***************************************************************************//**
* \file cy_capsense_csd.c
* \version 2.0
*
* \brief
* This file defines the data structure global variables and provides
* implementation for the low-level functions of the CSD part of
* the Sensing module. The file contains the functions used for the CSD HW block
* initialization, calibration, and scanning.
*
********************************************************************************
* \copyright
* Copyright 2018-2019, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/


#include <stddef.h>
#include "cy_device_headers.h"
#include "cy_sysclk.h"
#include "cy_syslib.h"
#include "cy_gpio.h"
#include "cy_csd.h"

#include "cy_capsense_common.h"
#include "cy_capsense_structure.h"
#include "cy_capsense_sensing.h"
#include "cy_capsense_csd.h"

#if defined(CY_IP_MXCSDV2)


/*******************************************************************************
* Local definition
*******************************************************************************/
/* CY_ID285392, CY_ID515 */
#define CY_CAPSENSE_FILTER_DELAY_MAX                        (CY_CAPSENSE_CSD_CONFIG_FILTER_DELAY_4_CYCLES)
#define CY_CAPSENSE_EXTRA_COUNTS_MAX                        (CY_CAPSENSE_FILTER_DELAY_MAX + 5u + 20u)
#define CY_CAPSENSE_16_BIT_RESOLUTION                       (16uL)

/*******************************************************************************
* Static Function Prototypes
*******************************************************************************/

/******************************************************************************/
/** \cond SECTION_CAPSENSE_INTERNAL */
/** \addtogroup group_capsense_internal *//** \{ */
/******************************************************************************/

__STATIC_INLINE void Cy_CapSense_CSDChangeClkFreq(uint32_t channelIndex, cy_stc_capsense_context_t * context);

static void Cy_CapSense_CSDInitNextSnsScan(cy_stc_capsense_context_t * context);
static void Cy_CapSense_CSDInitNextChScan(cy_stc_capsense_context_t * context);

static void Cy_CapSense_CSDEnableShieldElectrodes(const cy_stc_capsense_context_t * context);
static void Cy_CapSense_CSDCmodPrecharge(cy_stc_capsense_context_t * context);
static void Cy_CapSense_CSDTriggerScan(cy_stc_capsense_context_t * context);

static void Cy_CapSense_CSDDischargeCmod(cy_stc_capsense_context_t * context);
static void Cy_CapSense_CSDCalibrate(uint32_t widgetId, uint32_t target, 
                                                            cy_stc_capsense_context_t * context);
static uint32_t Cy_CapSense_CSDSwitchIdacGain(cy_stc_capsense_context_t * context);
static void Cy_CapSense_CSDNormalizeIdac(
                cy_stc_capsense_widget_config_t const * ptrWdConfig, 
                uint32_t target,
                const cy_stc_capsense_context_t * context);
/** \} \endcond */

/*******************************************************************************
* Function Name: Cy_CapSense_CSDDisableMode
****************************************************************************//**
*
* This function disables CSD mode.
*
* To disable CSD mode the following tasks are performed:
* 1. Disconnect Cmod from AMUXBUS-A.
* 2. Disconnect previous CSX electrode if it has been connected.
* 3. Disconnect Csh from AMUXBUS-B.
* 4. Disable Shield Electrodes.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSDDisableMode(cy_stc_capsense_context_t * context)
{
    /* Cmod pin to default state */
    Cy_CapSense_SsConfigPinRegisters(context->ptrCommonConfig->portCmod, (uint32_t)context->ptrCommonConfig->pinCmod, CY_GPIO_DM_ANALOG, CY_CAPSENSE_HSIOM_SEL_GPIO);

    if (0u != context->ptrCommonConfig->csdShieldEn)
    {
        /* Disconnect shields */
        Cy_CapSense_CSDDisableShieldElectrodes(context);
        
        if (0u != context->ptrCommonConfig->csdCTankShieldEn)
        {
            /* Csh pin to default state */
            Cy_CapSense_SsConfigPinRegisters(context->ptrCommonConfig->portCsh, (uint32_t)context->ptrCommonConfig->pinCsh, CY_GPIO_DM_ANALOG, CY_CAPSENSE_HSIOM_SEL_GPIO);
        }
    }
    
    /* Disconnect IDACA, IDACB and RefGen input */
    Cy_CSD_WriteReg(context->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_SW_REFGEN_SEL, 0u);

    /* Disconnect previous CSD sensor if it has been connected */
    Cy_CapSense_CSDSnsStateCheck(context);
}
    

/*******************************************************************************
* Function Name: Cy_CapSense_CSDEnableShieldElectrodes
****************************************************************************//**
*
* This internal function initializes Shield Electrodes.
*
* The function sets the bit in the HSIOM register which enables the shield electrode
* functionality on the pin. The port and pin configurations are stored in
* the cy_capsense_shieldIoList structure.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_CSDEnableShieldElectrodes(const cy_stc_capsense_context_t * context)
{
    uint32_t shieldIndex;
    const cy_stc_capsense_pin_config_t * ptrShieldPin = context->ptrShieldPinConfig;

    for (shieldIndex = 0u; shieldIndex < context->ptrCommonConfig->csdShieldNumPin; shieldIndex++)
    {
        Cy_CapSense_SsConfigPinRegisters(ptrShieldPin->pcPtr, (uint32_t)ptrShieldPin->pinNumber, CY_GPIO_DM_STRONG_IN_OFF, CY_CAPSENSE_HSIOM_SEL_CSD_SHIELD);
        ptrShieldPin++;
    }
}


