aws/amazon-freertos/vendors/cypress/psoc6/mw/capsense/cy_capsense_csd.c
    /* Configure IDACs mode */
    Cy_CSD_WriteReg(context->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_IDACA, context->ptrInternalContext->csdIdacAConfig);
    Cy_CSD_WriteReg(context->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_IDACB, context->ptrInternalContext->csdIdacBConfig);
    Cy_CSD_WriteReg(context->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_CONFIG, context->ptrInternalContext->csdRegConfig);

    /* Configure ModClk */
    Cy_CapSense_SetClkDivider((uint32_t)context->ptrCommonContext->modCsdClk - 1u, context);
    
    /* Setup ISR handler to single-sensor scan function */
    if(NULL != ptrFptrCfg->fptrCSDScanISR)
    {
        context->ptrActiveScanSns->ptrISRCallback = ptrFptrCfg->fptrCSDScanISR;
    }

    context->ptrActiveScanSns->mfsChannelIndex = 0u;
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSDSnsStateCheck
****************************************************************************//**
*
* Checks if electrodes were previously connected using
* Cy_CapSense_CSDSetupWidgetExt() and if yes disconnects them.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSDSnsStateCheck(cy_stc_capsense_context_t * context)
{
    if (CY_CAPSENSE_SNS_CONNECTED == context->ptrActiveScanSns->connectedSnsState)
    {
        Cy_CapSense_CSDDisconnectSnsExt(context);
    }
}

/*******************************************************************************
* Function Name: Cy_CapSense_CSDSetUpIdacs
****************************************************************************//**
*
* This function writes both IDACs available in CSD method into corresponding 
* the CSD HW block registers.
*
* Modulator IDAC is taken from widget context structure and Compensation
* IDAC is taken from sensor context structure.
* The cy_stc_active_scan_sns_t structure must be updated to the current 
* widget/sensor by Cy_CapSense_InitActivePtr() before calling this function.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSDSetUpIdacs(cy_stc_capsense_context_t * context)
{
    uint32_t regValue;

    cy_stc_active_scan_sns_t * ptrActive = context->ptrActiveScanSns;

    const uint32_t idacaBitsToWrite = CSD_IDACA_VAL_Msk |
                                      CSD_IDACA_RANGE_Msk |
                                      CSD_IDACA_LEG1_EN_Msk |
                                      CSD_IDACA_LEG2_EN_Msk;

    const uint32_t idacbBitsToWrite = CSD_IDACB_VAL_Msk |
                                      CSD_IDACB_RANGE_Msk |
                                      CSD_IDACB_LEG1_EN_Msk |
                                      CSD_IDACB_LEG2_EN_Msk |
                                      CSD_IDACB_LEG3_EN_Msk;

    /* IDAC A Code */
    if (ptrActive->ptrWdConfig->numCols > ptrActive->sensorIndex)
    {
        regValue = ptrActive->ptrWdContext->idacMod[ptrActive->mfsChannelIndex];
    }
    else
    {
        regValue = ptrActive->ptrWdContext->rowIdacMod[ptrActive->mfsChannelIndex];
    }

    regValue |= context->ptrCommonConfig->idacGainTable[ptrActive->ptrWdContext->idacGainIndex].gainReg;

    Cy_CSD_WriteBits(context->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_IDACA, idacaBitsToWrite, regValue);

    if (CY_CAPSENSE_ENABLE == context->ptrCommonConfig->csdIdacCompEn)
    {
        /* IDAC B Code */
        regValue = ptrActive->ptrSnsContext->idacComp;
        regValue |= context->ptrCommonConfig->idacGainTable[ptrActive->ptrWdContext->idacGainIndex].gainReg;
        
        Cy_CSD_WriteBits(context->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_IDACB, idacbBitsToWrite, regValue);
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSDGetNumberOfConversions
****************************************************************************//**
*
* This function calculate number of sub-conversions.
*
* \param snsClkDivider 
* The divider value of the sense clock.
*
* \param resolution
* The widget resolution.
*
* \param snsClkSrc
* The widget Sense Clock Source.
*
* \return 
* Returns the number of sub-conversions.
*
*******************************************************************************/
uint32_t Cy_CapSense_CSDGetNumberOfConversions(uint32_t snsClkDivider, uint32_t resolution, uint32_t snsClkSrc)
{
    /* CY_ID304273 */
    uint32_t conversionsNum = 1uL << resolution;
    uint32_t extraCounts = 0u;
    
    if (0u == snsClkDivider)
    {
        snsClkDivider = 1u;
    }
    
    if ((CY_CAPSENSE_CLK_SOURCE_PRS8 == snsClkSrc) || (CY_CAPSENSE_CLK_SOURCE_PRS12 == snsClkSrc))
    {
        snsClkDivider <<= 1u;
    }
    
    if(CY_CAPSENSE_16_BIT_RESOLUTION <= resolution)
    {
        /* CY_ID285392 */
        extraCounts = CY_CAPSENSE_EXTRA_COUNTS_MAX;
    }
    
    conversionsNum = (conversionsNum - extraCounts) / snsClkDivider;

    return((conversionsNum > 0u) ? (conversionsNum) : 1u);
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSDConfigClock
****************************************************************************//**
*
* This function configure sense clock for different modes.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSDConfigClock(cy_stc_capsense_context_t * context)
{
    const cy_stc_capsense_widget_context_t * ptrWdCxt = context->ptrActiveScanSns->ptrWdContext;
    uint32_t snsClkDivider;
    uint32_t snsClkSrc = (uint32_t)ptrWdCxt->snsClkSource & ((uint32_t)~(uint32_t)CY_CAPSENSE_CLK_SOURCE_AUTO_MASK);
    uint32_t regConfig = 0u;

